app/Controllers/Main.php

SELECT *
FROM `Catalogos`
---
    public function index()
    {


        $catalogos = new CatalogoModel();

        if(! session()->get('carrinho')){

            session()->set('carrinho',[
                'item' => [],
            ]);
        }


        $titulos['title']='PAGINA INICIAL';
        return view('templates/navbar', $titulos).
        view('index', ['catalogos' => $catalogos->findAll()]).
        view('templates/footer');