app/Controllers/Produtos.php

SELECT *
FROM `Catalogos`
WHERE `Nome` LIKE '%picole%' ESCAPE '!'
---
    public function buscarMenu()
    {
        $pesquisa = $this->request->getGet('pesquisar-catalogo');

        if ($pesquisa == NULL) {
            $catalogos = $this->catalogomodel->findAll();
        } else {
            $catalogos = $this->catalogomodel->like('Nome', $pesquisa)->findAll();