app/Controllers/Produtos.php

    public function addproduto()
    {
        $catalogos = new CatalogoModel();

        $titulos['title'] = 'ADICIONAR PRODUTO';
        return view('templates/navbar', $titulos) .
            view('addproduto', ['catalogos' => $catalogos->findAll()]) .
            view('templates/footer');
---
SELECT *
FROM `catalogos`

    public function cardapiomassa()
    {
        $produtos = new ProdutoModel();


        $titulos['title'] = 'CARDÁPIO MASSAS';
        return view('templates/navbar', $titulos) .
            view('cardapiomassa', ['produtos' => $produtos->where('menu_id', '2')->findAll()]) .
            view('templates/footer');
---
SELECT *
FROM `produtos`
WHERE `menu_id` = '2'