app/Controllers/Usuario.php

    public function tableprodutos()
    {
        $titulos['title'] = 'TABELA DE PRODUTOS';
        return view('templates/navbar', $titulos) .
            view('tableprodutos', [
                'tableprodutos' => $this->ProdutoModel->findAll()
            ]) .
            view('templates/footer');
---
SELECT *
FROM `produtos`